OpenFOAM_Maincode/tutorials/multiRegion/CHT/reverseBurner/constant/gas/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:
    Westbrook, C. K., & Dryer, F. L. (1981).
    Simplified reaction mechanisms for the oxidation of hydrocarbon fuels in
    flames.
    Combustion science and technology, 27(1-2), 31-43.

Notes:
    The reference gives parameters in a unit system of cm-sec-mole-kcal-Kelvin,
    whilst OpenFOAM uses m-sec-kmol-J-Kelvin, both the pre-exponential factors
    and the activation temperature/energy require unit conversion.

    The mechanism used is set 3 from table 2. This should be the most accurate
    single-step methane mechanism without any negative exponents. Set 2 is not
    usable because the negative exponent on the methane concentration causes
    divergence in regions without any fuel.

\*---------------------------------------------------------------------------*/

reactions
{
    methaneReaction
    {
        type     irreversibleArrhenius;
        reaction "CH4^0.2 + 2O2^1.3 = CO2 + 2H2O";
        A        2.11873e+11;
        beta     0;
        Ta       24357;
    }
}

// ************************************************************************* //
